{
    "name": "Duc Nguyen",
    "address": "Victoria, BC",
    "phone": "250-884-6325",
    "email" : "dukeng@uvic.ca",
    "website":"https://dukeng.github.io/",
    "github":"https://github.com/dukeng/",

    "company_name": "Relic Entertainment",
    "position": "Associate Programmer (Server) Co-op",
    "open_para":
    {
        "typical": "I am writing to apply to the {position} position with {company_name}. I am a third year a Computer Science student at the University of Victoria and I have very strong interests in software development; I can contribute to the position with my self-driven software knowledge as evidenced by my coop experience and my pursuit of various extracurricular activities. ",
        "game": "I am writing to apply to the {position} position with {company_name}. I am a third year Computer Science student at the University of Victoria and I have a passion in game development as evidenced by the games I have created and published as well as my coop experiences. I am confident that I can be a valuable member of your {company_name} team."
    },

    "first_coop":"In the summer of 2017, I worked as a software development engineer for Abebooks, an  Amazon Company for four months. I used Python to prototype the integration of a potential online payment service into the current systems to determine the feasibility for future business between the two companies. I tested the payment provider’s API, participated in evaluating risks and security loopholes and negotiating for customized features. Besides, I developed ecommerce features using Groovy with Spring MVC, JUnit, AWS: S3, SQS and databases such as PostgreSQL and Oracle. ",
    "second_coop":"My other work experience includes a four month coop term in September 2016 as a full stack web developer for RealtyServer System Inc., a company that offers multiple listing services for real estate business. My duties included implementing new features and functionalities for various real estate websites, using technology such as Java Servlet, Velocity template engine and Javascript, jQuery for frontend styling and RESTful API.",
    "activities" : {
        "battlesnake2018" : "I competed in 2018 Battlesnake AI competition to build a C++ snake to fight other snakes and won the first prize of $1000",
        "happylittlevillage" :"I created an Android game application which is published on GooglePlay and has achieved 500 downloads",
        "coursesearchoptimizer": "I used Chrome Extension API to create an extension that helps UVic students register for courses easily",
        "hackUvic2017" : "I created a web application that allows user in 24 hours using GoogleMap API, Python and PostgreSQL that won a Sponsor Prize at the UVic Hacks 2017"
    },
    "closing" : "I would like to thank you very much for considering my application, and I would greatly look forward to an opportunity to interview for the position offered by {company_name}. I can be reached by phone at {phone} or by email at {email}. For more information about me, please visit: {website}" 
}